group321 = {
    'Ekaterina', 'Alex', 'Tanya', 'Nataly', 'Nikolay'}

group311 = {
    'Sergey', 'Ruslan', 'Tanya', 'Oleg',
    'Alex', 'Pavel', 'David'}


print('Все студенты: ', group321 | group311) # объединение

print('Студенты, которые перешли: ', group321 & group311) # пересечение множеств

print('Студенты, не менявшие группу: ', group321 ^ group311)  # Оператор  ˆ  возвращает элементы, которые есть в первом множестве, но нет во втором, и элементы, которые есть в s2, но не в s1


# 1 Задайте множество чётных чисел (от 1 до 10) и множество чисел, делящихся на 3.




